{
  "backend/main.mo": "Motoko canister handling site settings, user profiles, and public inquiry submissions with admin-controlled access via AccessControl.",
  "feature_evidence.json": "Feature evidence report describing a logo replacement requirement and its associated components and tests.",
  "frontend-file-summaries.txt": "Text file listing short summaries of various frontend files and their roles in the project.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and theme tokens for light and dark modes.",
  "frontend/index.html": "Main HTML entry with metadata, Open Graph tags, fonts, and bootstrapping for the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for landing, inquiries, and settings pages and includes a global toaster.",
  "frontend/src/components/meraki/LoginButton.tsx": "Internet Identity login/logout button that handles auth state, errors, and query cache clearing.",
  "frontend/src/components/meraki/ProfileSetupDialog.tsx": "Dialog for first‑time admin profile setup allowing name entry and saving via backend mutation.",
  "frontend/src/features/booking/ContactBookingSection.tsx": "Validated contact and inquiry form supporting service selection, consent, and backend submission with success handling.",
  "frontend/src/features/landing/AboutSection.tsx": "Renders an About section with descriptive text about Rishab Mehta and highlight cards showcasing key achievements and qualities.",
  "frontend/src/features/landing/FaqSection.tsx": "Displays a FAQ section using an accordion to present common questions and detailed answers about offered services.",
  "frontend/src/features/landing/Footer.tsx": "Provides a footer with branding, navigation links, service shortcuts, and social media icons, including smooth-scroll behavior.",
  "frontend/src/features/landing/HeaderNav.tsx": "Implements a responsive header with scroll-based styling, navigation links, and a mobile menu toggle with smooth scrolling.",
  "frontend/src/features/landing/HeroSection.tsx": "Renders the hero banner with background imagery, headline, CTAs, and key statistics, including smooth-scroll actions.",
  "frontend/src/features/landing/HowItWorksSection.tsx": "Shows a four-step process using card components to explain how consultations and guidance services operate.",
  "frontend/src/features/landing/ServiceDetailsSection.tsx": "Renders detailed service cards with descriptions and expectations, and scrolls to the contact section with a service parameter in the URL.",
  "frontend/src/features/landing/ServicesSection.tsx": "Displays a grid of service preview cards and scrolls to detailed service sections when selected.",
  "frontend/src/features/landing/TestimonialsSection.tsx": "Shows static client testimonials with ratings and styled presentation cards.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls for inquiries, profiles, admin checks, and site settings using React Query and the actor instance.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme variables for a purple-gold design with light/dark modes and utility classes.",
  "frontend/src/lib/merakiServices.ts": "Defines Meraki service types and a registry of service metadata mapped to backend service values.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/InquiriesPage.tsx": "Displays and filters user inquiries with authentication checks and admin-only access handling.",
  "frontend/src/pages/LandingPage.tsx": "Composes the landing page by assembling multiple marketing and booking sections.",
  "frontend/src/pages/SiteSettingsPage.tsx": "Admin-only page for viewing and updating site contact and business settings with validation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Defines project version, branding notes, known issues, image requirements, and a list of implemented website features for Meraki's marketing site."
}