{
  "kind": "build_request",
  "title": "Generate a fresh project ZIP export download link",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-31",
      "text": "Generate a fresh ZIP archive export of the entire current project codebase (frontend, backend, static assets, and configuration files) and provide a new direct download link for that ZIP.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "yes  generate a fresh download link for the ZIP now"
        ]
      },
      "acceptanceCriteria": [
        "A new ZIP export is generated from the current project state (not a previously cached artifact).",
        "The ZIP includes frontend/, backend/, and the root config files specified by the export manifest.",
        "A direct download URL for the new ZIP is produced and returned."
      ]
    },
    {
      "id": "REQ-32",
      "text": "Validate that the generated ZIP download link is reachable and returns a ZIP payload before returning it to the user, and if the primary download host/domain is unreachable provide at least one alternative delivery option for the same ZIP export along with clear English instructions for the fallback.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "yes  generate a fresh download link for the ZIP now"
        ]
      },
      "acceptanceCriteria": [
        "An automated check confirms the primary download URL is reachable and returns a ZIP (correct content-type/extension or ZIP signature).",
        "If the primary URL cannot be reached from the automated check, at least one alternative download option is provided for the same ZIP artifact.",
        "User-facing fallback instructions are provided in English and explain exactly how to download via the alternative option."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files under frontend/src/components/ui.",
    "Keep all Motoko backend logic in the single actor in backend/main.mo; only add backend/migration.mo if a state upgrade is required."
  ],
  "nonGoals": [
    "Do not add new product features or change the Meraki website UI/UX as part of this request.",
    "Do not add any third-party hosting or external database integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}